---
title: Redis教程
tags: 数据库
---

## 一、安装Redis

　　**Redis是一个基于内存实现的key-value型非关系(NoSQL)数据库，由C语言编写**。Redis 用来缓存一些经常被访问的热点数据、或者需要耗费大量资源的内容，但是不适合存储较大的数据。

* ### 通过Docker安装Redis

　　1、下载Redis7镜像

```shell
docker pull redis:7
```

　　2、启动Redis服务

```shell
docker run -p 6379:6379 --name redis \
-v /mydata/redis/data:/data \
-d redis:7 redis-server --appendonly yes \
--restart=always
```

　　3、连接Redis客户端

```shell
docker exec -it redis redis-cli
```

## 二、Redis的5种常用数据类型

　　Redis用key-value存储数据，key一般是string类型，value有5种常用数据类型：**string、list、hash、set、zet**。

* ### key

　　关于key的一些常用命令如下：

　　1、判断key是否存在，存在返回1，不存在返回0

```shell
redis> EXISTS key1
```

　　2、查询与指定pattern匹配的key

```shell
redis> KEYS key*
```

　　3、修改key的名称

```shell
redis> RENAME key1 key2
```

　　4、删除key

```shell
redis> DEL key1
```

　　5、设置key的过期时间，以秒为单位

```shell
redis> EXPIRE key1 60
```

　　6、查询key剩余的过期时间(以秒为单位)，如果已经过期返回-2，如果永不过期返回-1

```shell
redis> TTL key1
```

* ### string

　　string是Redis中最简单的一种数据类型，它的常用命令如下：

　　1、为指定key设置value

```shell
redis> SET key1 value1
```

　　2、批量为key设置value

```shell
redis> MSET key1 value1 key2 value2 key3 value3
```

　　3、获取指定key的value

```shell
redis> GET key1
```

　　4、批量获取key的value

```shell
redis> MGET key1 key2 key3
```

　　5、为指定key设置value，并返回旧值

```shell
redis> GETSET key1 value2
```

　　6、获取指定key的value的长度

```shell
redis> STRLEN key1
```

　　7、截取指定key的value并返回，字符串索引从0开始，最后一个字符的索引可以用-1表示，倒数第二个索引可以用-2表示，以此类推

```shell
redis> GETRANGE key1 0 1
```

　　8、从指定索引处开始，用指定的字符串替换指定key的value

```shell
redis> SETRANGE key1 0 value3
```

* ### list

　　list相当于Java中的LinkedList，是一个链表，所以它增删快、查询慢。list可以实现**数组、双端队列**的功能。

　　list的常用命令如下：

　　1、从队列左边添加元素(string类型)

```shell
redis> LPUSH list1 element1 element2 element3
```

　　2、从队列右边添加元素

```shell
redis> RPUSH list1 element1 element2 element3
```

　　3、从队列左边开始，向第一个和指定元素相同的元素之前/之后插入新元素

```shell
redis> LINSERT list1 BEFORE targetElement newElement
redis> LINSERT list1 AFTER targetElement newElement
```

　　4、从队列左边开始，修改指定索引处的元素值，索引从0开始

```shell
redis> LSET list1 0 element4
```

　　5、从队列左边开始，获取指定索引处的元素

```shell
redis> LINDEX list1 0
```

　　6、从队列左边开始，获取指定索引范围内的元素

```shell
redis> LRANGE list1 0 -1
```

　　7、从队列左边开始，移除n个和指定元素相同的元素，n=0时代表全部移除

```shell
redis> LREM list1 2 element1
```

　　8、获取队列长度

```shell
redis> LLEN list1
```

　　9、从队列左边开始，弹出第一个元素

```shell
redis> LPOP list1
```

　　10、从队列右边开始，弹出第一个元素

```shell
redis> RPOP list1
```

　　11、从队列左边开始，弹出第一个元素，如果队列中没有元素，队列会进入阻塞状态，直到获取到元素，或者超出指定等待时间(单位是秒)

```shell
redis> BLPOP list1 60
```

　　12、从队列右边开始，弹出第一个元素，如果队列中没有元素，队列会进入阻塞状态，直到获取到元素，或者超出指定等待时间(单位是秒)

```shell
redis> BRPOP list1 60
```

* ### hash

　　Redis中的hash有点类似于Java中的Map，都是可以存储key-value对的集合，并且key不能重复。不同的地方在于hash的存储方式，它的key和value是相邻的两个元素，并且hash优先使用`ziplist`进行存储，`ziplist`是有序的，当超过大小限制后会使用`hashtable`进行存储，`hashtable`是无序的。

　　hash的常用命令如下：

　　1、添加或修改hash中的key-value对

```shell
redis> HSET hash1 key1 value1
```

　　2、获取key关联的value

```shell
redis> HGET hash1 key1
```

　　3、批量添加或修改hash中的key-value对

```shell
redis> HMSET hash1 key1 value1 key2 value2 key3 value3
```

　　4、批量获取key关联的value

```shell
redis> HMGET hash1 key1 key2 key3
```

　　5、删除一个或多个key-value对

```shell
redis> HDEL hash1 key1 key2 key3
```

　　6、获取hash中的所有key-value对

```shell
redis> HGETALL hash1
```

　　7、获取hash中的所有key

```shell
redis> HKEYS hash1
```

　　8、获取hash中的所有value

```shell
redis> HVALS hash1
```

　　9、判断hash中key是否存在

```shell
redis> HEXISTS hash1 key1
```

　　10、获取hash中key的数量

```shell
redis> HLEN hash1
```

* ### set

　　set用于存放不重复的元素，这一点和Java中的HashSet是一样的。它的增删、查询的时间复杂度都是O(1)。set可以实现**自动去重**。

　　set的常用命令如下：

　　1、向set中添加一个或多个元素，并自动去重

```shell
redis> SADD set1 element1 element2 element3
```

　　2、获取set中的所有元素

```shell
redis> SMEMBERS set1
```

　　3、判断元素是否存在于set中

```shell
redis> SISMEMBER set1 element1
```

　　4、获取set中元素的个数

```shell
redis> SCARD set1
```

　　5、移除set中的指定元素

```shell
redis> SREM set1 element1
```

　　6、求多个set之间的差集，这里的差集=前面的set-后面的set。可以将结果保存到指定set中

```shell
redis> SDIFF set1 set2 set3
redis> SDIFFSTORE targetSet set1 set2 set3
```

　　7、求多个set之间的交集，可以将结果保存到指定set中

```shell
redis> SINTER set1 set2 set3
redis> SINTERSTORE targetSet set1 set2 set3
```

　　8、求多个set之间的并集，可以将结果保存到指定set中

```shell
redis> SUNION set1 set2 set3
redis> SUNIONSTORE targetSet set1 set2 set3
```

* ### zset

　　zset也用来存放不重复元素，它和set的区别是，每个元素都关联了一个double类型的score(分数)，根据score的大小来决定元素的排列顺序，score越小越靠前。

　　zset的常用命令如下：

　　1、向zset中添加一个或多个元素，并自动去重

```shell
redis> ZADD zset1 1.2 element1 1.3 element2 1.1 element3
```

　　2、获取zset中指定索引范围内的元素

```shell
redis> ZRANGE zset1 0 -1
```

　　3、获取zset中指定score范围内的元素

```shell
redis> ZRANGEBYSCORE zset1 1.05 1.15
```

　　4、获取zset中指定score范围内的元素个数

```shell
redis> ZCARD zset1 1.05 1.15
```

　　5、移除zset中的一个或多个元素

```shell
redis> ZREM zset1 element1 element2
```

## 三、HyperLoglog基数统计

　　HyperLoglog是Redis-2.8.9中新增的数据类型，它用来存放**不重复元素的个数(基数)**，因为去重不够精确(0.81%的误差)，所以适用于对精度要求不是很高的大批量统计。

　　HyperLoglog的常用命令如下：

　　1、添加元素到HyperLoglog中

```shell
redis> PFADD pfset1 a b c a
```

　　2、获取HyperLoglog中不重复元素的个数

```shell
redis> PFCOUNT pfset1
```

　　3、将多个HyperLoglog合并为一个

```shell
redis> PFMERGE targetPfset pfset1 pfset2
```

## 四、GEO地理位置

　　GEO是Redis-3.2中新增的数据类型，它用来存放地理位置，底层用zset实现，看起来也很像zset，经纬度相当于score，位置名称相当于key。

　　GEO的常用命令如下：

　　1、添加地理位置到GEO集合中

```shell
redis> GEOADD city 116.20 39.56 beijing 120.52 30.40 shanghai
```

　　2、删除指定的地理位置

```shell
redis> ZREM city beijing
```

　　3、计算两个地理位置之间的距离，可以指定单位，m-米、km-千米、mi-英里、ft英尺

```shell
redis> GEODIST city beijing shanghai
```

　　4、以指定的经纬度或地理位置名称为中心，计算所有GEO集合中与中心之间的距离不超过指定距离的所有元素

```shell
redis> GEORADIUS city 116.20 39.56 1500 km WITHCOORD WITHDIST
redis> GEORADIUS city beijing 1500 km WITHCOORD WITHDIST
```

